const DESCRIPTIONS = [
  'Отличный день для новых начинаний!',
  'Летний вайб и ничего лишнего.',
  'Ловлю каждый момент.',
  'Красота вокруг нас, нужно только присмотреться.',
  'Мой лучший кадр за эту неделю.',
  'Просто оставлю это здесь.',
];

const MESSAGES = [
  'Всё отлично!',
  'В целом всё неплохо. Но не всё.',
  'Когда вы делаете фотографию, хорошо бы убирать палец из кадра. В конце концов это просто непрофессионально.',
  'Моя бабушка случайно чихнула с фотоаппаратом в руках и у неё получилась фотография лучше.',
  'Я поскользнулся на банановой кожуре и уронил фотоаппарат на кота и у меня получилась фотография лучше.',
  'Лица у людей на фотке перекошены, как будто их избивают. Как можно было поймать такой неудачный момент?!'
];

const NAMES = [
  'Артём', 'Иван', 'Мария', 'Ксения', 'Александр', 'Ольга', 'Дмитрий', 'Елена', 'Никита', 'Анна'
];

const PHOTO_COUNT = 25;
const MIN_LIKES = 15;
const MAX_LIKES = 200;
const MIN_AVATAR_INDEX = 1;
const MAX_AVATAR_INDEX = 6;
const MIN_COMMENTS = 0;
const MAX_COMMENTS = 30;
const MIN_SENTENCES = 1;
const MAX_SENTENCES = 2;

export {
  DESCRIPTIONS,
  MESSAGES,
  NAMES,
  PHOTO_COUNT,
  MIN_LIKES,
  MAX_LIKES,
  MIN_AVATAR_INDEX,
  MAX_AVATAR_INDEX,
  MIN_COMMENTS,
  MAX_COMMENTS,
  MIN_SENTENCES,
  MAX_SENTENCES
};
